// У вас есть ошибка
// 1. Не Паниковать и успокоиться
// 2. Открыть консоль --> инструменты разработчика / devTools --> ошибки
// 3. Какой тип ошибки --> подсказка что искать
// 4. Читаем тело ошибки - понять (перевести)
// 5. Смотрим ФАЙЛ и номер строки
// 6. Провалиться(перейти) в файл и посмотреть ошибку в SOURCES
// 7. command + p -> открывается поиск по файлам
// 8. Подчеркивает красным ошибку
// 9. Нажимаем на кретик - вылезает подсказка
// 10. Думаем
// 11. Гуглим ПРАВИЛЬНО
// 12. Чтобы найти нужный ответ - надо задать правильный вопрос
// 13. Если ошибка в коде то последуюий код перестает выполняться - поэтому каж что ниего не работает

// У вас ошибка вы не нашли ответ
// у коллег одногруппников преподавтеля
// сеньор мидл тимлид

// Описываете проблему
// вы скидываете скриншот проблемного кода
// вы скидываете (если связана с UI) скриншот в браузере
// говорите название фалйа и номер строки
// вы пишете по пунктам что вы сделали чтобы проблему решить
